// --- تعريف كلاس (Question) ---
// هذا الكلاس هو "القالب" لكل سؤال داخل الاختبار.
class Question {
  final String text; // نص السؤال نفسه
  final List<String> options; // قائمة الاختيارات (الأجوبة الأربعة)
  final int correctIndex; // رقم الإجابة الصحيحة (يبدأ من 0)

  // المُنشئ (Constructor): لإنشاء السؤال وربط البيانات ببعضها
  Question(
      {required this.text, required this.options, required this.correctIndex});
}

// --- قائمة أسئلة الاختبار (quizQuestions) ---
// هنا قمنا بتخزين الأسئلة الفعلية التي ستظهر للمستخدم في التطبيق.
final List<Question> quizQuestions = [
  // السؤال الأول
  Question(
      text: "ما هي المدينة الملقبة بالوردية؟",
      options: ["جرش", "البترا", "عمان", "العقبة"],
      correctIndex:
          1), // الإجابة الصحيحة هي "البترا" (لأن ترتيبها الثاني في القائمة)

  // السؤال الثاني
  Question(
      text: "أي من المعالم التالية يعتبر أخفض بقعة في العالم؟",
      options: ["وادي رم", "البحر الميت", "الأغوار", "العقبة"],
      correctIndex: 1),

  // السؤال الثالث
  Question(
      text: "ما هو الاسم الآخر لوادي رم؟",
      options: ["وادي الشمس", "وادي القمر", "وادي النجوم", "وادي الصمت"],
      correctIndex: 1),

  // السؤال الرابع
  Question(
      text: "في أي مدينة أثرية تجد 'شارع الأعمدة'؟",
      options: ["عجلون", "الكرك", "جرش", "مادبا"],
      correctIndex: 2),

  // السؤال الخامس
  Question(
      text: "من الذي بنى قلعة عجلون؟",
      options: ["الرومان", "الأنباط", "عز الدين أسامة", "العثمانيون"],
      correctIndex: 2),

  // السؤال السادس
  Question(
      text: "ما هي المحافظة التي تقع فيها مدينة البترا؟",
      options: ["الكرك", "معان", "الطفيلة", "اربد"],
      correctIndex: 1),

  // السؤال السابع
  Question(
      text: "بماذا يشتهر طين البحر الميت؟",
      options: ["البناء", "العلاج والتجميل", "صناعة الفخار", "الزراعة"],
      correctIndex: 1),

  // السؤال الثامن
  Question(
      text: "كم يبلغ طول 'السيق' في مدينة البترا تقريباً؟",
      options: ["500 متر", "1200 متر", "3000 متر", "100 متر"],
      correctIndex: 1),

  // السؤال التاسع
  Question(
      text: "ما هو المهرجان السنوي الشهير الذي يقام في مدينة جرش؟",
      options: [
        "مهرجان الفحيص",
        "مهرجان جرش للثقافة",
        "مهرجان الأردن",
        "مهرجان العقبة"
      ],
      correctIndex: 1),

  // السؤال العاشر
  Question(
      text: "ما الهدف الرئيسي من بناء قلعة عجلون قديماً؟",
      options: ["مستشفى", "قصر للملك", "حصن عسكري", "سوق تجاري"],
      correctIndex: 2),
];
